app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'joe@joe.com' LIMIT 1
---
  def login
    @user = User.find_by(email: user_params[:email])